app/Controllers/Admin/Dosen.php

    function index(){

        $data['dosen']=$this->db->table('dosen')->get()->getResultObject();
---
SELECT *
FROM `dosen`

    function edit($id=null){
        if($id==null){
            return redirect()->back()->with('error', 'NID tidak ditemukan');
        }else{
            $data['dosen']=$this->db->table('dosen')->where(['nid'=>$id])->get()->getRow();
---
SELECT *
FROM `dosen`
WHERE `nid` = '12344556'