app/Controllers/Admin/Home.php

SELECT COUNT(*) AS `numrows` FROM `makul`
SELECT COUNT(*) AS `numrows` FROM `dosen`
---
    function index(){
        $mahasiswa=$this->db->table('mhs')->countAll();
        $dos=$this->db->table('dosen')->countAll();
        $makul=$this->db->table('makul')->countAll();