app/Controllers/Admin/Kelas.php

SELECT *
FROM `mhsprodi`
SELECT *
FROM `mhsprodi`
WHERE `idprodi` = '1'
AND `angkatan` = '2019'
---
    function getsmsh($prodi=null,$angkatan=null){
                $ds=$this->db->table('mhsprodi');
                if ($angkatan==null and $prodi==null) {
                    $lists=$ds->get()->getResult();
                }else{
                    $lists=$ds->where('idprodi',$prodi)->where('angkatan',$angkatan)->get()->getResult();