app/Controllers/Admin/Mahasiswa.php

    function tambahmhs(){
        $data['prodi']=$this->db->table('prodi')->get()->getResultObject();
---
SELECT *
FROM `prodi`