app/Controllers/Admin/Matkul.php

UPDATE `makul` SET `matkul` = 'Makul 1', `sks` = '2', `semester` = '2'
WHERE `kode_matkul` = 'MK.1234.12'
---
    function savematkul($edit=false, $kodemk=null){
        $kodematkul=$this->request->getPost('kodematkul');
        $nama=$this->request->getPost('nama');
        $sks=$this->request->getPost('sks');
        $semester=$this->request->getPost('semester');
        $data=[
            'kode_matkul'=>$kodematkul,
            'matkul'=>$nama,
            'sks'=>$sks,
            'semester'=>$semester,
        ];
        if ($edit==false){
            $f=$this->db->table('makul')->insert($data);

            if ($f){
                return redirect()->to(base_url('/admin/matkul/tambah'))->with('success', 1);

            }else{
                return redirect()->to(base_url('/admin/matkul/tambah'))->with('error', 1);
            }
        }else{
            if(empty($kodematkul)){
                $d=[
                    'matkul'=>$nama,
                    'sks'=>$sks,
                    'semester'=>$semester,
                ];
            }else{
                $d=$data;
            }
            $f=$this->db->table('makul')->update($d, ['kode_matkul'=>$kodemk]);