app/Controllers/Admin/Penilaian.php

        $perta = $this->db->table('pertanyaan')->countAll();
        $pdf->SetFillColor(255, 134, 128);
        $pdf->ln();
        $ldosen = $this->db->table('dosen')->select(' dosen.nid as nid, nama_dosen, count(nama_dosen) as totalkelas')->join('kelas', 'dosen.nid=kelas.nid', 'left')->where(['kelas.idprodi' => $idprodi, 'thn_akademik' => $thaka])->where('dosen.nid',$nid)->get()->getRow();
---
SELECT `dosen`.`nid` as `nid`, `nama_dosen`, count(nama_dosen) as totalkelas
FROM `dosen`
LEFT JOIN `kelas` ON `dosen`.`nid`=`kelas`.`nid`
WHERE `kelas`.`idprodi` = '1'
AND `thn_akademik` = '20221'
GROUP BY `dosen`.`nid`

            $pdf->setFont('Times', '', 11);
            $nom = 1;
            foreach ($jenispert as $jpitem) {
                $sub = $this->db->table('pertanyaan')->where(['idjenis_pertanyaan' => $jpitem->idjenis_pertanyaan])->get()->getResult();
                //                e$pdf->Cell(160/sizeof($jenispert),7,$item->jenis,1,0,'C',true);

                foreach ($sub as $it) {
                    $nper = $this->db->table('nilai')->select('avg(nilai) as nilair')->join('kelas', 'nilai.nid=kelas.nid', 'INNER')->where(['nilai.nid' => $ldosen->nid, 'kelas.idprodi' => $idprodi, 'nilai.id_pertanyaan' => $it->idpertanyaan, 'nilai.thn_akademik' => $thaka])->get()->getRow();
---
SELECT *
FROM `pertanyaan`
WHERE `idjenis_pertanyaan` = '1'
SELECT avg(nilai) as nilair
FROM `nilai`
INNER JOIN `kelas` ON `nilai`.`nid`=`kelas`.`nid`
WHERE `nilai`.`nid` = '12314448'
AND `kelas`.`idprodi` = '1'
AND `nilai`.`id_pertanyaan` = '1'
AND `nilai`.`thn_akademik` = '20221'

            }

            $pdf->setFont('Times', 'B', 11);
            $nilai = $this->db->table('nilai')->join('kelas', 'nilai.nid=kelas.nid', 'inner')->where(['kelas.idprodi' => $idprodi, 'nilai.thn_akademik' => $thaka]);

            $nitotal=$nilai->select('avg(nilai) as n,count(nim) as responden')->where(['nilai.thn_akademik' => $thaka, 'kelas.nid'=> $ldosen->nid])->get()->getRow();
---
SELECT avg(nilai) as n, count(nim) as responden
FROM `nilai`
INNER JOIN `kelas` ON `nilai`.`nid`=`kelas`.`nid`
WHERE `kelas`.`idprodi` = '1'
AND `nilai`.`thn_akademik` = '20221'
AND `nilai`.`thn_akademik` = '20221'
AND `kelas`.`nid` = '12314448'
SELECT count(DISTINCT nim) as responden
FROM `nilai`
WHERE `nilai`.`thn_akademik` = '20221'
AND `nid` = '12314448'
GROUP BY `nim`