app/Controllers/Admin/Penilaian.php

    function index()
    {
        $data['thnaka']=$this->db->table('thn_akademik')->get()->getResult();
---
SELECT *
FROM `thn_akademik`

    function getnilai($thn_ajaran=null){

        $tab = $this->db->table('dosen');
        $tab->select('dosen.nid,nama_dosen, gelar, sum(nilai.nilai) as totalnilai,sum(nilai.nilai)/count(nilai.nilai) as rata')->join('nilai', 'dosen.nid=nilai.nid', 'left')->where('nilai.thn_akademik', $thn_ajaran)->groupBy('dosen.nid');
        $datas= $tab->get()->getResultObject();
---
SELECT `dosen`.`nid`, `nama_dosen`, `gelar`, sum(nilai.nilai) as totalnilai, sum(nilai.nilai)/count(nilai.nilai) as rata
FROM `dosen`
LEFT JOIN `nilai` ON `dosen`.`nid`=`nilai`.`nid`
GROUP BY `dosen`.`nid`

    function single($idprodi = 1, $thaka = 20221, $nid=null)
    {
        $dosen=$this->db->table('dosen')->where('nid', $nid)->get()->getRow();
        $prodi = $this->db->table('prodi')->where('idprodi', $idprodi)->get()->getRow();
---
SELECT *
FROM `dosen`
WHERE `nid` = '12314448'
SELECT *
FROM `prodi`
WHERE `idprodi` = '1'


        // Header
        $pdf->ln();
        $jenispert = $this->db->table('jenis_pertanyaan')->get()->getResult();
        $perta = $this->db->table('pertanyaan')->countAll();
---
SELECT *
FROM `jenis_pertanyaan`
SELECT COUNT(*) AS `numrows` FROM `pertanyaan`

            $pdf->setFont('Times', '', 11);
            $nom = 1;
            foreach ($jenispert as $jpitem) {
                $sub = $this->db->table('pertanyaan')->where(['idjenis_pertanyaan' => $jpitem->idjenis_pertanyaan])->get()->getResult();
                //                e$pdf->Cell(160/sizeof($jenispert),7,$item->jenis,1,0,'C',true);

                foreach ($sub as $it) {
                    $nper = $this->db->table('nilai')->select('avg(nilai) as nilair')->join('kelas', 'nilai.nid=kelas.nid', 'INNER')->where(['nilai.nid' => $ldosen->nid, 'kelas.idprodi' => $idprodi, 'nilai.id_pertanyaan' => $it->idpertanyaan, 'nilai.thn_akademik' => $thaka])->get()->getRow();
---
SELECT *
FROM `pertanyaan`
WHERE `idjenis_pertanyaan` = '1'
SELECT AVG(nilai) as rata
FROM `nilai`
INNER JOIN `kelas` ON `nilai`.`nid`=`kelas`.`nid`
WHERE `kelas`.`idprodi` = '1'
AND `nilai`.`thn_akademik` = '20221'
AND `kelas`.`nid` = '12344560'
AND `id_pertanyaan` = '1'
AND `nilai`.`nid` = '12344560'
AND `nilai`.`thn_akademik` = '20221'

            $pdf->setFont('Times', 'B', 11);
            $nilai = $this->db->table('nilai')->join('kelas', 'nilai.nid=kelas.nid', 'inner')->where(['kelas.idprodi' => $idprodi, 'nilai.thn_akademik' => $thaka]);

            $nitotal=$nilai->select('avg(nilai) as n,count(nim) as responden')->where(['nilai.thn_akademik' => $thaka, 'kelas.nid'=> $ldosen->nid])->get()->getRow();
---
SELECT avg(nilai) as tol, COUNT(nilai) as total
FROM `nilai`
WHERE `nilai`.`thn_akademik` = '20221'