app/Controllers/Home.php

SELECT *
FROM `mhs_kelas`
JOIN `kelas` ON `mhs_kelas`.`id_kelas`=`kelas`.`id_kelas`
JOIN `dosen` ON `kelas`.`nid`=`dosen`.`nid`
JOIN `makul` ON `kelas`.`kode_matkul`=`makul`.`kode_matkul`
WHERE `mhs_kelas`.`nim` = 201915002
SELECT *
FROM `dosen`
INNER JOIN `kelas` ON `dosen`.`nid`=`kelas`.`nid`
INNER JOIN `makul` ON `kelas`.`kode_matkul`=`makul`.`kode_matkul`
WHERE `dosen`.`nid` = '12344560'
---
    public function index()
    {
        if(empty(session('logged_in'))){
            return redirect()->to(base_url('auth'));
        }
        if(empty(session('nim'))){
            return redirect()->to(base_url('auth'));
        }

        $dos=$this->db->table('mhs_kelas')->join('kelas', 'mhs_kelas.id_kelas=kelas.id_kelas')->join('dosen', 'kelas.nid=dosen.nid')->join('makul', 'kelas.kode_matkul=makul.kode_matkul')->join('thn_akademik', 'kelas.thn_akademik=thn_akademik.thn_akademik', 'inner')->where('thn_akademik.aktif=1')->where('mhs_kelas.nim='.session('nim'));
        $data['dosen']=$dos->get()->getResultObject();
//        var_dump($data['dosen']);
        $data['nama']=session('nama');
        $data['thn_akademik']=$this->db->table('thn_akademik')->where('aktif=1')->get()->getRow()->thn_akademik;

SELECT *
FROM `jenis_pertanyaan`
SELECT *
FROM `pertanyaan`
WHERE `idjenis_pertanyaan` = '1'
---
    function penilaian($dosen){
        if (empty(session('nim'))){
            return redirect()->to(base_url('auth'));
        }
        $data['nid']=$dosen;
        $data['dosen']=$this->db->table('dosen')->join('kelas', 'dosen.nid=kelas.nid', 'inner')->join('makul', 'kelas.kode_matkul=makul.kode_matkul', 'inner')->join('thn_akademik', 'kelas.thn_akademik=thn_akademik.thn_akademik', 'inner')->where('thn_akademik.aktif=1')->where('dosen.nid', $dosen)->get()->getRow();
        $jp=$this->db->table('jenis_pertanyaan')->get()->getResult();
        $data['jenispertanyaan']=$jp;
        foreach ($jp as $jitem) {
            $pa=$this->db->table('pertanyaan')->where('idjenis_pertanyaan', $jitem->idjenis_pertanyaan)->get()->getResultObject();