app/Controllers/Home.php

SELECT *
FROM `jenis_pertanyaan`
SELECT *
FROM `pertanyaan`
WHERE `idjenis_pertanyaan` = '1'
---
    function penilaian(){
        $jp=$this->db->table('jenis_pertanyaan')->get()->getResult();
        $data['jenispertanyaan']=$jp;
        foreach ($jp as $jitem) {
            $pa=$this->db->table('pertanyaan')->where('idjenis_pertanyaan', $jitem->idjenis_pertanyaan)->get()->getResultObject();